In [118]:
import pandas as pd

In [119]:
df=pd.read_csv('titanic (1).csv')
df.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [120]:
df=df[['Pclass','Sex','Age','Fare','Survived']]
df.head()

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

In [121]:
target=df[['Survived']]
inputs=df.drop('Survived', axis=1)

In [122]:
dummies=pd.get_dummies(inputs.Sex).astype(int)
dummies.head()

   female  male
0       0     1
1       1     0
2       1     0
3       1     0
4       0     1

In [123]:
inputs=pd.concat([inputs,dummies], axis=1)

In [124]:
inputs=inputs.drop('Sex', axis='columns')
inputs.head()

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0
3       1  35.0  53.1000       1     0
4       3  35.0   8.0500       0     1

In [125]:
inputs.columns[inputs.isna().any()]

Index(['Age'], dtype='object')

In [126]:
inputs.Age[:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [127]:
inputs.Age=inputs.Age.fillna(inputs.Age.mean())
inputs.Age[:10]

0    22.000000
1    38.000000
2    26.000000
3    35.000000
4    35.000000
5    29.699118
6    54.000000
7     2.000000
8    27.000000
9    14.000000
Name: Age, dtype: float64

In [128]:
from sklearn.model_selection import train_test_split
x_train,x_test,y_train,y_test=train_test_split(inputs,target,test_size=0.2)

In [129]:
from sklearn.naive_bayes import GaussianNB
model=GaussianNB()

In [130]:
model.fit(x_train,y_train)
model.score(x_test,y_test)

C:\Users\priya\anaconda3\Lib\site-packages\sklearn\utils\validation.py:1184: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)

0.7541899441340782

In [131]:
model.predict(x_test)

array([0, 0, 1, 1, 0, 0, 0, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1,
       1, 0, 1, 0, 0, 0, 1, 1, 1, 0, 0, 0, 1, 1, 0, 1, 0, 1, 0, 0, 0, 0,
       0, 1, 0, 0, 1, 0, 0, 0, 1, 0, 0, 1, 0, 1, 0, 0, 1, 1, 0, 0, 0, 0,
       0, 0, 0, 1, 1, 0, 0, 1, 0, 0, 1, 0, 0, 1, 1, 0, 0, 1, 1, 1, 0, 0,
       0, 0, 0, 0, 0, 0, 1, 0, 0, 1, 0, 1, 0, 0, 0, 0, 1, 1, 1, 0, 1, 0,
       0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 1, 0, 1, 0,
       0, 1, 1, 0, 0, 1, 1, 0, 1, 0, 0, 0, 1, 1, 1, 0, 0, 1, 0, 0, 0, 1,
       0, 0, 0, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 1, 1,
       1, 0, 0], dtype=int64)

In [132]:
x_test[0:10]

     Pclass        Age      Fare  female  male
592       3  47.000000    7.2500       0     1
811       3  39.000000   24.1500       0     1
564       3  29.699118    8.0500       1     0
518       2  36.000000   26.0000       1     0
493       1  71.000000   49.5042       0     1
620       3  27.000000   14.4542       0     1
714       2  52.000000   13.0000       0     1
748       1  19.000000   53.1000       0     1
700       1  18.000000  227.5250       1     0
13        3  39.000000   31.2750       0     1

In [133]:
y_test[:10]

     Survived
592         0
811         0
564         0
518         1
493         0
620         0
714         0
748         0
700         1
13          0

In [134]:
model.predict(x_test[0:10])

array([0, 0, 1, 1, 0, 0, 0, 0, 1, 0], dtype=int64)

In [135]:
model.predict_proba(x_test[:10])

array([[9.90254061e-01, 9.74593926e-03],
       [9.90542711e-01, 9.45728860e-03],
       [5.31434977e-02, 9.46856502e-01],
       [2.36958600e-02, 9.76304140e-01],
       [7.84026347e-01, 2.15973653e-01],
       [9.90478554e-01, 9.52144622e-03],
       [9.76724748e-01, 2.32752519e-02],
       [8.54649335e-01, 1.45350665e-01],
       [7.97502219e-11, 1.00000000e+00],
       [9.89726303e-01, 1.02736966e-02]])

In [137]:
from sklearn.model_selection import cross_val_score
cross_val_score(GaussianNB(),x_train,y_train)

C:\Users\priya\anaconda3\Lib\site-packages\sklearn\utils\validation.py:1184: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)
C:\Users\priya\anaconda3\Lib\site-packages\sklearn\utils\validation.py:1184: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)
C:\Users\priya\anaconda3\Lib\site-packages\sklearn\utils\validation.py:1184: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)
C:\Users\priya\anaconda3\Lib\site-packages\sklearn\utils\validation.py:1184: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)
C:\Users\priya\anaconda3\Lib\site-packages\sklearn\utils\validation.py:1184: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)

array([0.83916084, 0.74825175, 0.76056338, 0.78873239, 0.8028169 ])